# Terminal customizations
cask "alacritty"
brew "bat"
brew "eza"
brew "fzf"
brew "macos-trash"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh"
# Utils
brew "coreutils"
brew "curl"
brew "git"
brew "jq"
brew "neovim"
brew "wget"
cask "rectangle"
# Fonts
cask "font-sauce-code-pro-nerd-font"

# Others
## Misc
cask "1password-cli"
brew "gnupg"
brew "pinentry-mac"
brew "pinentry"
brew "pipenv"
brew "pyenv"
brew "sevenzip"
brew "telnet"
## AWS
brew "aws-iam-authenticator"
brew "aws-vault"
brew "awscli"
## K8s
brew "k9s"
brew "helm"
brew "stern"
brew "flux"
brew "kubectx"
brew "kubeseal"
## Devops tools
cask "visual-studio-code"
brew "docker-compose"
brew "docker"
brew "ansible"
brew "tfswitch"
brew "tgswitch"
brew "terraform-ls"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "podman"
brew "pre-commit"